{
  "summaries": {
    "1": {
      "1": "MayeHisCaffBeFine (mattyoungin) absolutely put the league on notice, racking up 135.88 points thanks to a monster day from Christian McCaffrey (31.4) and Justin Jefferson (22.0), plus Tua Tagovailoa’s efficient 17.2—while BurrowBoiSeason (BigBoiSeason) self-sabotaged by benching Amon-Ra St. Brown (26.1) and fading Travis Kelce in the TE spot (14.0). To add insult, James Conner limped off early with a shoulder tweak—rookie mistake. Smack talk: Better dust off your waiver strategy next week, BurrowBoi. 🥴",
      "2": "Koo my Warren till I Kupp (adamloo) lit up the scoreboard with Patrick Mahomes’ 29.6 and Tyreek Hill’s 18.5, steamrolling Nacua Matata (mmalsin) 124.62–99.06. Nacua Matata’s flex gamble on Drake London (11.2) over JuJu Smith-Schuster (15.0) was straight-up tragic, and Aaron Jones’ last-second ankle scratch sealed the deal. Smack talk: Hope you packed the tissues, mmalsin, because that defeat stings.",
      "3": "Ready 4 Cancun (michaelb555) cruised to a 109.38–93.86 victory over MasterBater (mattcinelli) behind Amon-Ra St. Brown’s 26.1 and solid support from Joe Mixon (18.5). MasterBater’s faith in De’Von Achane (6.5) flopped, and benching Rondale Moore (12.4) felt like amateur hour. Smack talk: MasterBater, pick better next time—or just sit this league out.",
      "4": "Champ (BrendanKane) outgunned In CEST zone (ItalianGardettos) 107.58–88.12, thanks to Patrick Mahomes’ dual-threat day (29.6) and Travis Kelce’s vintage 14.0. ItalianGardettos’ punt on Kyren Williams (4.8) was the rookie blunder heard ’round the league, and Christian Kirk’s ankle tweak left a gaping hole. Smack talk: ItalianGardettos—sit down, son. This was a masterclass, not a moral victory.",
      "5": "Kamara Sutra (BiggoJohnson) throttled Droppin’ a Deuce (moneymike805) 131.52–102.78, fueled by Bijan Robinson’s 22.7 and a surprise from Jaylen Waddle (16.3). Droppin’ a Deuce’s DJ Moore ghosted them with just 7.3 points, and Aaron Jones’ lingering ankle issue cost a critical flex spot. Smack talk: Better dust off that Snapchat filter, moneymike805—you got roasted.",
      "6": "Chasing Wittle Kyler (milesbarrios) outlasted Gibb me dat (nforbes6) 110.42–86.34 as Tua Tagovailoa (17.2) and Brock Purdy (20.2) outduelled Josh Jacobs (12.9) and Nico Collins (14.4). Gibb me dat’s benching of Courtland Sutton (11.0) over Elijah Moore (8.2) was criminal—rookie mistake alert. Smack talk: Gibb me dat, hope your dignity is still intact after that curb stomp."
    }
  }
}
